---
type: AreaBasedLoadBoundaryLineData
namespace: Autodesk.Revit.DB.Electrical
version: 2024
members: 7
tags: [revit-api, class]
---

# AreaBasedLoadBoundaryLineData

`Autodesk.Revit.DB.Electrical.AreaBasedLoadBoundaryLineData` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetLevelIdsInRange | 2023 | `public ISet < ElementId > GetLevelIdsInRange ()` |
| Method | IsElevationWithinRange | 2023 | `public bool IsElevationWithinRange ( double elev )` |
| Method | IsLevelWithinRange | 2023 | `public bool IsLevelWithinRange ( ElementId levelId )` |
| Property | BottomLevelId | 2023 | `public ElementId BottomLevelId { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | TopLevelId | 2023 | `public ElementId TopLevelId { get ; set ; }` |